Type of the referenced family
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public string TypeName { get; }
  Visual Basic
Public ReadOnly Property TypeName As String
	Get
  Visual C++
public:
property String^ TypeName {
	String^ get ();
}
 See Also
  NestedFamilyTypeReference Class
  Autodesk.Revit.DB Namespace